

var myAudioFIles = [];
var quotes = [];

quotes.push('<p>जो ऐसा मानता है कि मैं दूसरों को दु:खी या सुखी करता हूँ, वह वस्तुत: अज्ञानी है। ज्ञानी ऐसा कभी नहीं मानते । <br></p><div class=aacharyaName>-- कुन्दकुन्दाचार्य<br></div>');
quotes.push('<p>उन द्रव्य-जातियों की समस्त विद्यमान और अविद्यमान पर्यायें तात्कालिक पर्यायों की भाँति, विशिष्टता-पूर्वक ज्ञान में वर्तती हैं ।<br></p><div class=aacharyaName>-- कुन्दकुन्दाचार्य</div>');
quotes.push('<p>पर के कारण मूर्ख ज्ञानी नहीं हो सकता और ज्ञानी मूर्ख नहीं हो सकता । पर पदार्थ धर्मास्तिकाय के समान निमित्त-मात्र है ।<br></p><div class=aacharyaName>-- आचार्य‌ पूज्यपाद</div>');
quotes.push('<p>तीनों काल में सदा विषम, सर्व क्षेत्र के अनेक प्रकार के समस्त पदार्थों को जिनदेव का ज्ञान एक साथ जानता है अहो ! ज्ञान का माहात्म्य ! <br></p><div class=aacharyaName>-- कुन्दकुन्दाचार्य</div>');
quotes.push('<p>आत्मा पदार्थों को जानता हुआ भी उस रूप परिणमित नहीं होता, उन्हें ग्रहण नहीं करता और उन पदार्थों के रूप में उत्पन्न नहीं होता इसलिये उसे अबन्धक कहा है । <br></p><div class=aacharyaName>-- कुन्दकुन्दाचार्य<br></div>');
quotes.push('<p>आत्मा ज्ञान-स्वरूप है, स्वयं ज्ञान ही है; अत: वह ज्ञान के अतिरिक्त और क्या करे ? आत्मा पर-भाव का कर्ता है - ऐसा मानना व्यवहारी-जीवों का मोह है, अज्ञान है ।<br></p><div class=aacharyaName>-- अमृतचंद्राचार्य<br></div>');
quotes.push('<p>चारित्र वास्तव में धर्म है । जो धर्म है वह साम्य है ऐसा कहा है । साम्य मोह-क्षोभ रहित ऐसा आत्मा का परिणाम है । <br></p><div class=aacharyaName>-- कुन्दकुन्दाचार्य<br></div>');
quotes.push('<p>जो नयों के पक्षपात को छोड़कर सदा स्वरूप में गुप्त होकर निवास करते हैं, वे ही साक्षात् अमृत का पान करते हैं; क्योंकि उनका चित्त विकल्प-जाल रहित हो गया है और एकदम शान्त हो गया है ।<br></p><div class=aacharyaName>-- अमृतचंद्राचार्य<br></div>');
quotes.push('<p>कर्म बन्धन से रहित हुए जिसके द्वारा समस्त पर द्रव्य को छोड़कर, ज्ञानमय आत्मा प्राप्त किया गया है, वह ही परम-आत्मा है । अन्तःकरण से समझ ।<br></p><div class=aacharyaName>-- योगींदुदेव<br></div>');
quotes.push('<p>जैसी निर्मल, ज्ञानमय परम-आत्मा सिद्धशिला में रहती है, वैसी ही परम-आत्मा देहों में रहती है, तू भेद मत कर ।<br></p><div class=aacharyaName>-- योगींदुदेव<br></div>');
quotes.push('<p>आत्मा, मन रहित, इन्द्रिय रहित, मूर्ति रहित, ज्ञानमय चेतना मात्र है, इन्द्रियों का विषय नहीं है । यह लक्षण बताया गया है ।<br></p><div class=aacharyaName>-- योगींदुदेव<br></div>');
quotes.push('<p>एक द्रव्य के द्वारा दोनों द्रव्यों का परिणमन किया जा रहा है, ऐसा मुझे प्रतिभासित मत होवे ।<br></p><div class=aacharyaName>-- अमृतचंद्राचार्य<br></div>');
quotes.push('<p>बेल की तरह मुक्ति को प्राप्त हुए जिस जीव का ज्ञान- ज्ञेय के अभाव में लौटकर परम स्वभाव का प्रतिपादन करके प्रतिबिम्बित हुआ स्थिर हो जाता है ।<br></p><div class=aacharyaName>-- योगींदुदेव<br></div>');
quotes.push('<p>जिसने आत्‍म-स्‍वरूप के विषय में स्थिरता प्राप्‍त कर ली है, ऐसा योगी बोलते हुए भी नहीं बोलता, चलते हुए भी नहीं चलता और देखते हुए भी नहीं देखता है । <br></p><div class=aacharyaName>-- आचार्य‌ पूज्यपाद</div>');
quotes.push('<p>यदि प्राणी की दृष्टि तिमिर-नाशक हो तो दीपक से कोई प्रयोजन नहीं है, उसी प्रकार जहाँ आत्मा स्वयं सुख-रूप परिणमन करता है वहाँ विषय क्या कर सकते हैं ?<br></p><div class=aacharyaName>-- कुन्दकुन्दाचार्य</div>');
quotes.push('<p>देखो, भिन्‍न-भिन्‍न दिशाओं व देशों से उड़ उड़कर आते हुए पक्षिगण वृक्षों पर आकर रैनबसेरा करते हैं और सबेरा होने पर अपने अपने कार्य के वश से जुदा-जुदा दिशाओं व देशों में उड़ जाते हैं । <br></p><div class=aacharyaName>-- आचार्य‌ पूज्यपाद</div>');
quotes.push('<p>सर्वदा परिग्रह के रक्षण में, रखने-उठाने एवं सार-सम्हाल में लगे रहने के कारण मनुष्य का मन उसी में आकुल-व्याकुल रहता है अत: उसका स्वाध्याय छूट जाता है, और जो स्वाध्याय ही नहीं करता वह ध्यान कैसे कर सकता है । <br></p><div class=aacharyaName>-- आचार्य‌ अमितगति</div>');
quotes.push('<p>जैसे नगर का वर्णन करने पर राजा का वर्णन कभी नहीं होता, शरीर के गुणों का स्तवन करने पर केवली के गुणों का स्तवन नहीं होता ।<br></p><div class=aacharyaName>-- कुन्दकुन्दाचार्य<br></div>');
quotes.push('<p>निदान शल्य प्रशस्त, अप्रशस्त और भोगकृत के भेद से तीन प्रकार का है । मुक्ति-लाभ का कारण रत्नत्रय है और एकमात्र पाप-स्वरूप होने के कारण यह निदान शल्य रत्नत्रय का निषेधक अर्थात् घातक है ।<br></p><div class=aacharyaName>-- आचार्य अमितगति </div>');
quotes.push('<p>आयु गल जाती है, पर मन नहीं गलता, आशा नहीं गलती । मोह तो स्फुरित होता है, परन्तु आत्महित का स्फुरण नहीं होता, इसी से संसार में भ्रमण होता है ।<br></p><div class=aacharyaName>-- आ. योगींदुदेव</div>');
quotes.push('<p>जो सत्पात्र को दान देकर धन का संग्रह करने में तत्पर है, वह उस धन को परलोक में अपने साथ ले जाता है । अत: वह लोभियों में महा लोभी है ।<br></p><div class=aacharyaName>-- सोमदेव सूरि</div>');
quotes.push('<p>﻿जाति, मित्र-वर्ग, पुत्र और बान्धव उसका दु:ख नही बँटा सकते । वह स्वयं अकेला दु.ख का अनुभव करता है । क्योकि कर्म कर्त्ता का अनुगमन करता है ।</div>');
quotes.push('<p>दुर्बुद्धि वेद्य को तो जानते हैं वेदक को क्यों नहीं जानते? प्रकाश्य को तो देखते हैं किन्तु प्रकाशक को नहीं देखते, यह कैसा आश्चर्य है ?<br></p><div class=aacharyaName>-- आचार्य अमितगति</div>');
quotes.push('<p>﻿ज्ञान आदि कार्य उत्सर्ग एवं अपवाद से सत्य होते हैं, वे इस तरह किए जाएँ कि सब कुछ सफल हो ।</div>');
quotes.push('<p>﻿जिसके मोह नही है, उसने दुख का नाश कर दिया। जिसके तृष्णा नहीं है, उसने मोह का नाश कर दिया। जिसके लोभ नही हैं, उसने तृष्णा का नाश कर दिया (और) जिसके पास कुछ नही है, उसने लोभ का (ही) नाश कर दिया ।</div>');
quotes.push('<p>﻿सत्य रूपी आधार, तप रूपी तेल, दया रूपी बाती और क्षमा रूपी लौ वाले दीपक को अंधरे में प्रवेश करने से पहले यत्न-पूर्वक जला लेना चाहिए।</div>');
quotes.push('<p>﻿जो जो रात बीतती है वह लौटकर नहीं आती; अधर्म करनेवाले की रात्रियाँ निष्फल चली जाती है ।</div>');
quotes.push('<p>﻿आत्मा ही सुख-दुख का कर्ता है, भोक्ता है; सत्प्रवृत्ति और दुष्प्रवृत्ति में स्थित आत्मा ही अपना मित्र और शत्रु है ।</div>');
quotes.push('<p>﻿उचित यही है कि में स्वयं ही संयम और तप द्वारा अपने पर विजय प्राप्त करूँ । बंधन और वध के द्वारा दूसरों से मैं प्रताड़ित किया जाऊँ, यह ठीक नहीं है ।</div>');
quotes.push('<p>﻿जबकि कषायों को उपशांत करनेवाला पुरुष भी अनंत प्रतिपात को प्राप्त हो जाता है, तब अवशिष्ट थोड़ी से कषाय पर कैसे विश्वास किया जा सकता है?</div>');
quotes.push('<p>﻿ऋण को थोड़ा, घाव को छोटा, आग को तनिक और कषायों को अल्प मान, विश्वस्त होकर नहीं बैठ जाना चाहिए; ये थोड़े भी बढ़कर बहुत हो जाते हैं ।</div>');
quotes.push('<p>﻿क्रोध प्रीति को नष्ट करता है, मान विनय को नष्ट करता है, माया मैत्री को नष्ट करती है और लोभ सब कुछ नष्ट कर देता है ।</div>');
quotes.push('<p>﻿जिसे तू हनन-योग्य मानता है, वह तू ही है । जिसे तू आज्ञा में रखने योग्य मानता है, वह तू ही है । </div>');
quotes.push('<p>वस्तु जिस रूप में है, उसको उसी रूप में जानना आत्मा को जिस कारण से होता है, उसको जिनेन्द्र देव ने सम्यक्त्व कहा है । वह सम्यक्त्व आत्मसिद्धि का साधन है ।<br></p><div class=aacharyaName>-- आचार्य अमितगति</div>');
quotes.push('<p>﻿आशुप्रज्ञ पंडित सोए हुए व्यक्तियों के बीच भी जाग्रत रहे, प्रमाद में विश्वास न करे । मुहर्त बड़े घोर होते हैं, शरीर दुर्बल है, इसलिए भारण्ड पक्षी की भांति अप्रमत्त होकर विचरण करे ।</div>');
quotes.push('<p>﻿अज्ञानी कर्म द्वारा कर्म का क्षय नहीं करता, धीर पुरुष अकर्म द्वारा कर्म का क्षय करते हैं, मेधावी पुरुष लोभ और मद से अतीत होते हैं, संतोषी पाप नहीं करते ।</div>');
quotes.push('<p>﻿शुद्ध-आत्मा वास्तव में अरस, अरूप, अगन्ध, अव्यक्त, चैतन्य, अशब्द, अलिङ्गगाह्य और संस्थान-रहित है ।  </div>');
quotes.push('<p>﻿क्रियाविहीन ज्ञान व्यर्थ है और अज्ञानियों की क्रिया व्यर्थ है । जैसे पंगु व्यक्ति वन में लगी आग को देखते हुए भी भागने में असमर्थ होने से जल मरता है और अंधा व्यक्ति दौड़ते हुए भी देखने में असमर्थ होने से जल मरता है ।</div>');
quotes.push('<p>﻿हे योगी ! यदि तू परलोक चाहता है तो ख्याति, लाभ, पूजा और सत्कार आदि क्यों चाहता है ? क्या इनसे तुझे परलोक का सुख मिलेगा ?</div>');
quotes.push('<p>﻿कुछ अज्ञान के कारण नष्ट हैं, कुछ प्रमाद के कारण नष्ट हैं, कुछ ज्ञान के अवलेप से नष्ट हो रहे हैं और कुछ नष्टों द्वारा नष्ट किए जा रहे हैं ।</div>');
quotes.push('<p>﻿यह संसार एक खूबसूरत बनी हुई नाट्यशाला है; सिद्ध परमात्मा दर्शक हैं, अनेक प्रकार देहधारी यह जीव नर्तक है और कर्म नाटकाचार्य है । यह जीव इस नाट्यशाला में लाल, पीले, हरे, श्वेत, काले और छोटे-बड़े देह को धारण कर ऊँच-नीच कुलों में, उत्तम नट के समान नृत्य करता है ।<br></p><div class=aacharyaName>--सोमसेन भट्टारक</div>');
quotes.push('<p>﻿भव के भय का भेदन करनेवाले इन भगवान के प्रति क्या तुझे भक्ति नहीं है ? तो तू भव-समुद्र के मध्य में रहनेवाले मगर के मुख में है ।<br></p><div class=aacharyaName>--पद्मप्रभमलधारिदेव</div>');
quotes.push('<p>इसी ध्‍यान से दिव्‍य चिंतामणि मिल सकता है, इसी से खली के टुकड़े भी मिल सकते हैं । जब कि ध्‍यान के द्वारा दोनों मिल सकते हैं, तब विवेकी लोग किस ओर आदरबुद्धि करेंगे ? <br></p><div class=aacharyaName>-- आचार्य पूज्यपाद<br></div>');
quotes.push('<p>जब तक निर्मल आत्म-स्वभाव की तू भावना नहीं करेगा, तब-तक मोक्ष को प्राप्त नहीं कर सकता जहाँ इच्छा हो, वहाँ जा ।<br></p><div class=aacharyaName>-- आचार्य योगींदुदेव</div>');
quotes.push('<p>जब तक एकमात्र परमशुद्ध पवित्र भाव को नहीं जानता ऐसा मिथ्यादृष्टि व्रत, तप, संयम और मूलगुण होते हुए भी मोक्ष से निवृत्त है ।<br></p><div class=aacharyaName>-- आचार्य योगींदुदेव</div>');
quotes.push('<p>जिनेन्द्र-देव सम्यग्दर्शन से युक्त चांडाल देहधारी मनुष्य को भी राख के भीतर ढंके हुए अंगारे के भीतरी प्रकाश के समान पूज्य कहते हैं  ।<br></p><div class=aacharyaName>-- समन्तभद्राचार्य</div>');
quotes.push('<p>धर्म और पाप से कुत्ता भी देव और देव भी कुत्ता हो जाता है । जीवों को धर्म से अन्य और भी अनिर्वचनीय सम्पदा प्राप्त होती है  ।<br></p><div class=aacharyaName>-- समन्तभद्राचार्य</div>');

var curQuote=0;
var quoteCol=['darkRed', 'darkBlue', 'maroon', 'darkGreen', 'darkMagenta', 'indigo'];

// Shuffle Array
function shuffle(array) {
    for (var i = array.length - 1; i > 0; i--) {
        var j = Math.floor(Math.random() * (i + 1));
        var temp = array[i];
        array[i] = array[j];
        array[j] = temp;
    }
}
function load_quotes() {
    $('#myQuotes').html(quotes[curQuote]);
    $('#myQuotes p').css( 'color', quoteCol[curQuote%(quoteCol.length)]);
    curQuote++;
    if(curQuote==quotes.length) curQuote=0;
    setTimeout(load_quotes, 10000);
}

$(document).on( 'pagecontainershow', function(){
    //    // Swip Panel Code
    //    //$( document ).on( "swipeleft swiperight", "#demo-page", function( e ) {
    //    $( document ).on( "swiperight", "#demo-page", function( e ) {
    //        // We check if there is no open panel on the page because otherwise
    //        // a swipe to close the left panel would also open the right panel (and v.v.).
    //        // We do this by checking the data that the framework stores on the page element (panel: open).
    //        if ( $( ".ui-page-active" ).jqmData( "panel" ) !== "open" ) {
    //            //if ( e.type === "swipeleft" ) {
    //            //    $( "#right-panel" ).panel( "open" );
    //            //} else if ( e.type === "swiperight" ) {
    //            if ( e.type === "swiperight" ) {
    //                $( "#leftPanel" ).panel( "open" );
    //            }
    //        }
    //    });
    var myAudio;
    var myAudioCntr=0;
    if(myAudioFIles.length>0) {
      $('#myRadioIconDiv').show();
    }
    shuffle(quotes);
    var maxHeight = $( window ).height() - 60 + "px";
    $('#myQuotes').css( 'height', maxHeight );
    load_quotes();

    $('#myRadioNextId').click(function() {
        if (myAudio) {
            myAudio.pause();
            myAudioCntr++;
            myAudio.setAttribute('src',myAudioFIles[myAudioCntr]);
            myAudio.play();
        }
    })

    $('#myRadioId').click(function() {
        if(myAudioFIles.length==0) {
            alert("No Audio Files Detected");
        } else {
          shuffle(myAudioFIles);
          if (myAudio) {
              myAudioCntr=0;
              myAudio.pause();
              myAudio.remove();
              myAudio=null;
          } else {
              myAudio = document.createElement("AUDIO");
              myAudio.setAttribute('src',myAudioFIles[0]);
              myAudio.setAttribute('controls', 'controls');
              $('#myRadio').html(myAudio);
              playAudio();
          }
      }
    });

    function playAudio() {
        myAudio.setAttribute('src',myAudioFIles[myAudioCntr]);
        myAudio.play();
        myAudio.addEventListener('ended', function() {
            myAudioCntr++;
            playAudio();
        });
    }
})
